Revit 2026 API

# ViewUnhideElements Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void UnhideElements(
	ICollection<ElementId> elementIdSet
)
```
```vb
Public Sub UnhideElements (
	elementIdSet As ICollection(Of ElementId)
)
```
```cpp
public:
void UnhideElements(
	ICollection<ElementId^>^ elementIdSet
)
```
```fsharp
member UnhideElements :
        elementIdSet : ICollection<ElementId> -> unit
```

#### Parameters

elementIdSet ICollectionElementId

#### Reference

View Class

Autodesk.Revit.DB Namespace